Hi @sahaqaa I believe the original issue is now fixed.  I was able to remove my `ignore_changes` work-around and the drift is no longer present in the `cloudconnexa_network` resource after adding a description to each default connector.

Unfortunately, it looks like a regression may have been introduced on the `cloudconnexa_connector` resource where it now shows drift with existing resource on the optional description.  Note that this is especially dangerous as the resource will be destroyed and recreated.


Sample code:

```
resource "cloudconnexa_connector" "secondary" {
  description       = "Test description"
  name              = "secondary"
  network_item_id   = cloudconnexa_network.this[each.key].id
  network_item_type = "NETWORK"
  vpn_region_id     = each.value.vpn_region_id
}
```

Plan:
```
Terraform will perform the following actions:

  # module.connexa.cloudconnexa_connector.secondary["aws-vpc-prd"] must be replaced
-/+ resource "cloudconnexa_connector" "secondary" {
      + description       = "Test description" # forces replacement
      ~ id                = "018864b2-59d1-4180-b835-916f65128eb4" -> (known after apply)
      ~ ip_v4_address     = "10.11.0.102/28" -> (known after apply)
      ~ ip_v6_address     = "fd:0:0:8106::6/64" -> (known after apply)
        name              = "secondary"
.
.
.
```

Again, a work-around for this is to add the lifecycle to the resource:

```
  lifecycle {
    ignore_changes = [
      description
    ]
  }
```

I hope this is enough information. Thank you for the help!